# 1) написати прогу, яка вибирає зі введеної строки цифри і виводить їх через кому,
# наприклад:
# 2,3,5,4,4        #вивело в консолі.
#
# st = 'as 23 fdfdg544'  # введена строка
# for i in st:
#     if i.isdigit():
#         print(i, end=",")


# 2)написати прогу, яка вибирає зі введеної строки числа і виводить їх так, як вони написані
# наприклад:
#   23, 544, 34              #вивело в консолі

st = 'as 23 fdfdg544 34'  # введена строка

print(', '.join(''.join(num if num.isdigit() else ' ' for num in st).split()))
